In [1]:
import pandas as pd
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [2]:
weather_data = [('1/1/2017',32,6,'Rain'),
                ('1/2/2017',35,6,'Sunny'),
                ('1/3/2017',28,6,'Snow'),
                ('1/4/2017',30,6,'Rain'),
                ('1/5/2017',31,6,'Snow'),
                ('1/6/2017',36,6,'Sunny')
                ]

df = pd.DataFrame(weather_data,columns=['day','temperature','windspeed','event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          6  Sunny
2  1/3/2017           28          6   Snow
3  1/4/2017           30          6   Rain
4  1/5/2017           31          6   Snow
5  1/6/2017           36          6  Sunny

In [3]:
print(df.columns)

print(df.shape)

print(df.head())

print(df.tail())

print(df.day)

print(df.event)

print(df[2:5])

print(df[['day','temperature']])

df['temperature']

df['windspeed']

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')
(6, 4)
        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          6  Sunny
2  1/3/2017           28          6   Snow
3  1/4/2017           30          6   Rain
4  1/5/2017           31          6   Snow
        day  temperature  windspeed  event
1  1/2/2017           35          6  Sunny
2  1/3/2017           28          6   Snow
3  1/4/2017           30          6   Rain
4  1/5/2017           31          6   Snow
5  1/6/2017           36          6  Sunny
0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object
0     Rain
1    Sunny
2     Snow
3     Rain
4     Snow
5    Sunny
Name: event, dtype: object
        day  temperature  windspeed event
2  1/3/2017           28          6  Snow
3  1/4/2017           30          6  Rain
4  1/5/2017           31          6  Snow
        day  temperature
0  1/1/2017           32
1  1/2/2017           35
2  1/3/2017           28
3  1/4/2017           30
4  1/5/2017           31
5  1/6/2017           36

0    6
1    6
2    6
3    6
4    6
5    6
Name: windspeed, dtype: int64

In [4]:
print(df['temperature'].max())

print(df['temperature'].min())

print(df['temperature'].describe())

36
28
count     6.00000
mean     32.00000
std       3.03315
min      28.00000
25%      30.25000
50%      31.50000
75%      34.25000
max      36.00000
Name: temperature, dtype: float64

In [5]:
#select rows which has maximum temperature
print(df[df.temperature == df.temperature.max()])

#select rows which has minimum temperature
print(df[df.temperature == df.temperature.min()])

        day  temperature  windspeed  event
5  1/6/2017           36          6  Sunny
        day  temperature  windspeed event
2  1/3/2017           28          6  Snow

In [6]:
df.day[df.temperature == df.temperature.min()]

2    1/3/2017
Name: day, dtype: object

In [7]:
df = pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [8]:
df['windspeed'].mean()

np.float64(4.666666666666667)

In [9]:
df.to_csv('new.csv')
df.to_csv('new_noIndex.csv',index=False)

In [11]:
df.to_excel('new.xlsx',sheet_name='weather_data')

# GROUP BY

In [12]:
import pandas as pd
df = pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [13]:
g = df.groupby('city')
g

In [ ]:
for city , city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [15]:
df.min()

day            1/1/2017
city             mumbai
temperature          28
windspeed             5
event            Cloudy
dtype: object

In [18]:
Mean = g['temperature'].mean()
print(Mean)
Median = g['temperature'].median()
print(Median)
S = g['temperature'].std()
print(S)
Min = g['temperature'].min()
print(Min)
Max = g['temperature'].max()
print(Max)

city
mumbai      88.50
new york    32.25
paris       47.75
Name: temperature, dtype: float64
city
mumbai      88.5
new york    32.5
paris       47.5
Name: temperature, dtype: float64
city
mumbai      3.109126
new york    3.304038
paris       5.315073
Name: temperature, dtype: float64
city
mumbai      85
new york    28
paris       42
Name: temperature, dtype: int64
city
mumbai      92
new york    36
paris       54
Name: temperature, dtype: int64

In [19]:
g.get_group('new york') #to get specific group

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

# Concatenate Data Frame

In [25]:
import pandas as pd

india_weather = pd.DataFrame({
    "city" : ["mumbai","Delhi","Banglore"],
    "temperature" : [32,45,30],
    "humidity" : [80,60,70]
})

india_weather

       city  temperature  humidity
0    mumbai           32        80
1     Delhi           45        60
2  Banglore           30        70

In [26]:
us_weather = pd.DataFrame({
    "city" : ["new york","chicago","orlando"],
    "temperature" : [21,14,35],
    "humidity" : [68,65,75]
})

us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
#concate 
df = pd.concat([india_weather,us_weather])
print(df)

       city  temperature  humidity
0    mumbai           32        80
1     Delhi           45        60
2  Banglore           30        70
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
#if you want continuous index
df = pd.concat([india_weather,us_weather],ignore_index=True)
print(df)

       city  temperature  humidity
0    mumbai           32        80
1     Delhi           45        60
2  Banglore           30        70
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [34]:
df = pd.concat([india_weather,us_weather],axis = 1) #By default 0
print(df)

       city  temperature  humidity      city  temperature  humidity
0    mumbai           32        80  new york           21        68
1     Delhi           45        60   chicago           14        65
2  Banglore           30        70   orlando           35        75

# Merge Data Frames

In [41]:
temperature_df = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore",'hyderabad'],
    "temperature": [32,45,30,40]})

temperature_dtemperature_df = pd.DataFrame({
    "city" : ["mumbai","delhi","banglore",'hyderabad'],
    "temperature": [32,45,30,40]
})

temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [37]:
humidity_df = pd.DataFrame({
    "city" : ["delhi","mumbai",'banglore'],
    "humidity": [68,65,75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [42]:
df = pd.merge(temperature_df,humidity_df,on= 'city')
df

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           30        75

In [43]:
df = pd.merge(temperature_df,humidity_df,on= 'city',how='outer')
df

        city  temperature  humidity
0   banglore           30      75.0
1      delhi           45      68.0
2  hyderabad           40       NaN
3     mumbai           32      65.0

# Numerical Indexing (.loc vs .iloc)

In [45]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45,1,2,3,4,3])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
3   19

In [46]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [47]:
df.iloc[:2]

    0
49  1
48  2

In [49]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [50]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds